```terraform
[command]/home/runner/work/_temp/fbaaa73a-4845-45f4-8bf7-ce6a068ca4ed/terraform-bin plan -out=environment.tfplan -no-color
module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]
module.vpc.data.aws_vpc.default: Reading...
module.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]
module.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]
module.vpc.data.aws_security_group.ec2_public[0]: Reading...
module.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]
module.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...
module.vpc.data.aws_subnet.public_2[0]: Reading...
module.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]
module.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]
module.vpc.data.aws_subnet.private_1[0]: Reading...
module.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...
module.vpc.data.aws_subnet.public_1[0]: Reading...
module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]
module.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]
module.iam.data.aws_iam_role.lambda_role[0]: Reading...
module.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]
module.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]
module.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]
module.vpc.data.aws_subnet.private_2[0]: Reading...
module.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]
module.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]
module.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]
module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]
module.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]
module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]
module.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]
module.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]
module.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]
module.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]
module.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]
module.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]
module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]
module.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]
module.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-QDNBQA3GMWJ5L4VRFGEOQFO6EY]
module.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]
module.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]
module.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # module.apigateway.aws_api_gateway_gateway_response.default_4xx will be destroyed
  # (because module.apigateway is not in configuration)
  - resource "aws_api_gateway_gateway_response" "default_4xx" {
      - id                  = "aggr-l6xivppfkg-DEFAULT_4XX" -> null
      - response_parameters = {
          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          - "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"
        } -> null
      - response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}"
        } -> null
      - response_type       = "DEFAULT_4XX" -> null
      - rest_api_id         = "l6xivppfkg" -> null
    }

  # module.apigateway.aws_api_gateway_gateway_response.default_5xx will be destroyed
  # (because module.apigateway is not in configuration)
  - resource "aws_api_gateway_gateway_response" "default_5xx" {
      - id                  = "aggr-l6xivppfkg-DEFAULT_5XX" -> null
      - response_parameters = {
          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          - "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"
        } -> null
      - response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}"
        } -> null
      - response_type       = "DEFAULT_5XX" -> null
      - rest_api_id         = "l6xivppfkg" -> null
    }

  # module.apigateway.aws_api_gateway_gateway_response.unauthorized_response will be destroyed
  # (because module.apigateway is not in configuration)
  - resource "aws_api_gateway_gateway_response" "unauthorized_response" {
      - id                  = "aggr-l6xivppfkg-UNAUTHORIZED" -> null
      - response_parameters = {
          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          - "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"
        } -> null
      - response_templates  = {
          - "application/json" = "{\"message\":$context.error.messageString}"
        } -> null
      - response_type       = "UNAUTHORIZED" -> null
      - rest_api_id         = "l6xivppfkg" -> null
      - status_code         = "401" -> null
    }

  # module.apigateway.aws_api_gateway_rest_api.default will be destroyed
  # (because module.apigateway is not in configuration)
  - resource "aws_api_gateway_rest_api" "default" {
      - api_key_source               = "HEADER" -> null
      - arn                          = "arn:aws:apigateway:us-east-1::/restapis/l6xivppfkg" -> null
      - binary_media_types           = [] -> null
      - created_date                 = "2024-01-05T03:45:49Z" -> null
      - disable_execute_api_endpoint = false -> null
      - execution_arn                = "arn:aws:execute-api:us-east-1:791901361445:l6xivppfkg" -> null
      - id                           = "l6xivppfkg" -> null
      - name                         = "staging-web-api" -> null
      - root_resource_id             = "tgvxm2bra7" -> null
      - tags                         = {} -> null
      - tags_all                     = {} -> null

      - endpoint_configuration {
          - types            = [
              - "EDGE",
            ] -> null
          - vpc_endpoint_ids = [] -> null
        }
    }

  # module.apigateway.aws_ssm_parameter.api_gateway_id will be destroyed
  # (because module.apigateway is not in configuration)
  - resource "aws_ssm_parameter" "api_gateway_id" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/id" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/api_gateway/id" -> null
      - name      = "/terraform/staging/api_gateway/id" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id will be destroyed
  # (because module.apigateway is not in configuration)
  - resource "aws_ssm_parameter" "api_gateway_root_resource_id" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/root_resource_id" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/api_gateway/root_resource_id" -> null
      - name      = "/terraform/staging/api_gateway/root_resource_id" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.apigateway[0].aws_api_gateway_gateway_response.default_4xx will be created
  + resource "aws_api_gateway_gateway_response" "default_4xx" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_4XX"
      + rest_api_id         = (known after apply)
    }

  # module.apigateway[0].aws_api_gateway_gateway_response.default_5xx will be created
  + resource "aws_api_gateway_gateway_response" "default_5xx" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "DEFAULT_5XX"
      + rest_api_id         = (known after apply)
    }

  # module.apigateway[0].aws_api_gateway_gateway_response.unauthorized_response will be created
  + resource "aws_api_gateway_gateway_response" "unauthorized_response" {
      + id                  = (known after apply)
      + response_parameters = {
          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"
          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"
          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"
          + "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"
        }
      + response_templates  = {
          + "application/json" = "{\"message\":$context.error.messageString}"
        }
      + response_type       = "UNAUTHORIZED"
      + rest_api_id         = (known after apply)
      + status_code         = "401"
    }

  # module.apigateway[0].aws_api_gateway_rest_api.default will be created
  + resource "aws_api_gateway_rest_api" "default" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "staging-web-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # module.apigateway[0].aws_ssm_parameter.api_gateway_id will be created
  + resource "aws_ssm_parameter" "api_gateway_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/api_gateway/id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.apigateway[0].aws_ssm_parameter.api_gateway_root_resource_id will be created
  + resource "aws_ssm_parameter" "api_gateway_root_resource_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/api_gateway/root_resource_id"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.dynamodb.aws_dynamodb_table.access_token will be destroyed
  # (because module.dynamodb is not in configuration)
  - resource "aws_dynamodb_table" "access_token" {
      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-AccessToken" -> null
      - billing_mode                = "PROVISIONED" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "token_id" -> null
      - id                          = "staging-AccessToken" -> null
      - name                        = "staging-AccessToken" -> null
      - read_capacity               = 1 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 1 -> null

      - attribute {
          - name = "token_id" -> null
          - type = "S" -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # module.dynamodb.aws_dynamodb_table.company will be destroyed
  # (because module.dynamodb is not in configuration)
  - resource "aws_dynamodb_table" "company" {
      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-Company" -> null
      - billing_mode                = "PROVISIONED" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "company_id" -> null
      - id                          = "staging-Company" -> null
      - name                        = "staging-Company" -> null
      - read_capacity               = 1 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 1 -> null

      - attribute {
          - name = "company_id" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "email" -> null
          - type = "S" -> null
        }

      - global_secondary_index {
          - hash_key           = "email" -> null
          - name               = "EmailIndex" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - read_capacity      = 10 -> null
          - write_capacity     = 10 -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # module.dynamodb.aws_dynamodb_table.criterion will be destroyed
  # (because module.dynamodb is not in configuration)
  - resource "aws_dynamodb_table" "criterion" {
      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-Criterion" -> null
      - billing_mode                = "PROVISIONED" -> null
      - deletion_protection_enabled = false -> null
      - hash_key                    = "id" -> null
      - id                          = "staging-Criterion" -> null
      - name                        = "staging-Criterion" -> null
      - read_capacity               = 1 -> null
      - stream_enabled              = false -> null
      - table_class                 = "STANDARD" -> null
      - tags                        = {} -> null
      - tags_all                    = {} -> null
      - write_capacity              = 1 -> null

      - attribute {
          - name = "checklist_id" -> null
          - type = "S" -> null
        }
      - attribute {
          - name = "id" -> null
          - type = "S" -> null
        }

      - global_secondary_index {
          - hash_key           = "checklist_id" -> null
          - name               = "ChecklistIdIndex" -> null
          - non_key_attributes = [] -> null
          - projection_type    = "ALL" -> null
          - read_capacity      = 10 -> null
          - write_capacity     = 10 -> null
        }

      - point_in_time_recovery {
          - enabled = false -> null
        }

      - ttl {
          - enabled = false -> null
        }
    }

  # module.dynamodb[0].aws_dynamodb_table.access_token will be created
  + resource "aws_dynamodb_table" "access_token" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "token_id"
      + id               = (known after apply)
      + name             = "staging-AccessToken"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "token_id"
          + type = "S"
        }
    }

  # module.dynamodb[0].aws_dynamodb_table.company will be created
  + resource "aws_dynamodb_table" "company" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "company_id"
      + id               = (known after apply)
      + name             = "staging-Company"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "company_id"
          + type = "S"
        }
      + attribute {
          + name = "email"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "email"
          + name               = "EmailIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + read_capacity      = 10
          + write_capacity     = 10
        }
    }

  # module.rds.aws_db_instance.secure[0] will be destroyed
  # (because module.rds is not in configuration)
  - resource "aws_db_instance" "secure" {
      - address                               = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 20 -> null
      - apply_immediately                     = false -> null
      - arn                                   = "arn:aws:rds:us-east-1:791901361445:db:staging" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-east-1a" -> null
      - backup_retention_period               = 0 -> null
      - backup_target                         = "region" -> null
      - backup_window                         = "05:09-05:39" -> null
      - ca_cert_identifier                    = "rds-ca-2019" -> null
      - copy_tags_to_snapshot                 = false -> null
      - customer_owned_ip_enabled             = false -> null
      - db_name                               = "staging" -> null
      - db_subnet_group_name                  = "staging" -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      - endpoint                              = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com:5432" -> null
      - engine                                = "postgres" -> null
      - engine_version                        = "14" -> null
      - engine_version_actual                 = "14.9" -> null
      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "db-QDNBQA3GMWJ5L4VRFGEOQFO6EY" -> null
      - identifier                            = "staging" -> null
      - instance_class                        = "db.t3.micro" -> null
      - iops                                  = 0 -> null
      - license_model                         = "postgresql-license" -> null
      - listener_endpoint                     = [] -> null
      - maintenance_window                    = "tue:07:39-tue:08:09" -> null
      - master_user_secret                    = [] -> null
      - max_allocated_storage                 = 0 -> null
      - monitoring_interval                   = 0 -> null
      - multi_az                              = false -> null
      - network_type                          = "IPV4" -> null
      - option_group_name                     = "default:postgres-14" -> null
      - parameter_group_name                  = "default.postgres14" -> null
      - password                              = (sensitive value) -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 5432 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - resource_id                           = "db-QDNBQA3GMWJ5L4VRFGEOQFO6EY" -> null
      - skip_final_snapshot                   = true -> null
      - status                                = "available" -> null
      - storage_encrypted                     = false -> null
      - storage_throughput                    = 0 -> null
      - storage_type                          = "gp2" -> null
      - tags                                  = {} -> null
      - tags_all                              = {} -> null
      - username                              = "postgres" -> null
      - vpc_security_group_ids                = [
          - "sg-00d8df4b18c6781f4",
        ] -> null
    }

  # module.rds.aws_db_subnet_group.secure[0] will be destroyed
  # (because module.rds is not in configuration)
  - resource "aws_db_subnet_group" "secure" {
      - arn                     = "arn:aws:rds:us-east-1:791901361445:subgrp:staging" -> null
      - description             = "Managed by Terraform" -> null
      - id                      = "staging" -> null
      - name                    = "staging" -> null
      - subnet_ids              = [
          - "subnet-018110fcdfaa13ea2",
          - "subnet-06383153ba9f3fde3",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {} -> null
      - tags_all                = {} -> null
      - vpc_id                  = "vpc-01c5f678c56d122c2" -> null
    }

  # module.rds.aws_ssm_parameter.db_instance_endpoint will be destroyed
  # (because module.rds is not in configuration)
  - resource "aws_ssm_parameter" "db_instance_endpoint" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/endpoint" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/rds/endpoint" -> null
      - name      = "/terraform/staging/rds/endpoint" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.rds.aws_ssm_parameter.db_instance_name will be destroyed
  # (because module.rds is not in configuration)
  - resource "aws_ssm_parameter" "db_instance_name" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_name" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/rds/db_name" -> null
      - name      = "/terraform/staging/rds/db_name" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.rds.aws_ssm_parameter.db_instance_password will be destroyed
  # (because module.rds is not in configuration)
  - resource "aws_ssm_parameter" "db_instance_password" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_password" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/rds/db_password" -> null
      - key_id    = "alias/aws/ssm" -> null
      - name      = "/terraform/staging/rds/db_password" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "SecureString" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.rds.aws_ssm_parameter.db_instance_port will be destroyed
  # (because module.rds is not in configuration)
  - resource "aws_ssm_parameter" "db_instance_port" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/port" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/rds/port" -> null
      - name      = "/terraform/staging/rds/port" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.rds.aws_ssm_parameter.db_instance_username will be destroyed
  # (because module.rds is not in configuration)
  - resource "aws_ssm_parameter" "db_instance_username" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_username" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/rds/db_username" -> null
      - name      = "/terraform/staging/rds/db_username" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.rds[0].aws_db_instance.secure[0] will be created
  + resource "aws_db_instance" "secure" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + apply_immediately                     = false
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + db_name                               = "staging"
      + db_subnet_group_name                  = "staging"
      + delete_automated_backups              = true
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14"
      + engine_version_actual                 = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "staging"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t3.micro"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = "default.postgres14"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = true
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp2"
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "postgres"
      + vpc_security_group_ids                = [
          + "sg-00d8df4b18c6781f4",
        ]
    }

  # module.rds[0].aws_db_subnet_group.secure[0] will be created
  + resource "aws_db_subnet_group" "secure" {
      + arn                     = (known after apply)
      + description             = "Managed by Terraform"
      + id                      = (known after apply)
      + name                    = "staging"
      + name_prefix             = (known after apply)
      + subnet_ids              = [
          + "subnet-018110fcdfaa13ea2",
          + "subnet-06383153ba9f3fde3",
        ]
      + supported_network_types = (known after apply)
      + tags_all                = (known after apply)
      + vpc_id                  = (known after apply)
    }

  # module.rds[0].aws_ssm_parameter.db_instance_endpoint will be created
  + resource "aws_ssm_parameter" "db_instance_endpoint" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/rds/endpoint"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds[0].aws_ssm_parameter.db_instance_name will be created
  + resource "aws_ssm_parameter" "db_instance_name" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/rds/db_name"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds[0].aws_ssm_parameter.db_instance_password will be created
  + resource "aws_ssm_parameter" "db_instance_password" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/rds/db_password"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds[0].aws_ssm_parameter.db_instance_port will be created
  + resource "aws_ssm_parameter" "db_instance_port" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/rds/port"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.rds[0].aws_ssm_parameter.db_instance_username will be created
  + resource "aws_ssm_parameter" "db_instance_username" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/rds/db_username"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.s3.aws_s3_bucket.candidate_response will be created
  + resource "aws_s3_bucket" "candidate_response" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "staging-data-candidate-response"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_cors_configuration.candidate_response will be created
  + resource "aws_s3_bucket_cors_configuration" "candidate_response" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "POST",
              + "PUT",
            ]
          + allowed_origins = [
              + "https://www.staging.matchyaa.com",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

  # module.s3.aws_s3_bucket_policy.space_profile will be created
  + resource "aws_s3_bucket_policy" "space_profile" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # module.s3.aws_s3_bucket_public_access_block.candidate_response will be created
  + resource "aws_s3_bucket_public_access_block" "candidate_response" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

  # module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_sqs_queue" "checklist_evaluation_processor_queue" {
      - arn                               = "arn:aws:sqs:us-east-1:791901361445:staging-checklist-evaluation-processor-queue" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 90 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - max_message_size                  = 2048 -> null
      - message_retention_seconds         = 86400 -> null
      - name                              = "staging-checklist-evaluation-processor-queue" -> null
      - receive_wait_time_seconds         = 10 -> null
      - sqs_managed_sse_enabled           = true -> null
      - tags                              = {} -> null
      - tags_all                          = {} -> null
      - url                               = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue" -> null
      - visibility_timeout_seconds        = 300 -> null
    }

  # module.sqs.aws_sqs_queue.checklist_generation_processor_queue will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_sqs_queue" "checklist_generation_processor_queue" {
      - arn                               = "arn:aws:sqs:us-east-1:791901361445:staging-checklist-generation-processor-queue" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 90 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - max_message_size                  = 2048 -> null
      - message_retention_seconds         = 86400 -> null
      - name                              = "staging-checklist-generation-processor-queue" -> null
      - receive_wait_time_seconds         = 10 -> null
      - sqs_managed_sse_enabled           = true -> null
      - tags                              = {} -> null
      - tags_all                          = {} -> null
      - url                               = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue" -> null
      - visibility_timeout_seconds        = 300 -> null
    }

  # module.sqs.aws_sqs_queue.question_generation_processor_queue will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_sqs_queue" "question_generation_processor_queue" {
      - arn                               = "arn:aws:sqs:us-east-1:791901361445:staging-question-generation-processor-queue" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 90 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - max_message_size                  = 2048 -> null
      - message_retention_seconds         = 86400 -> null
      - name                              = "staging-question-generation-processor-queue" -> null
      - receive_wait_time_seconds         = 10 -> null
      - sqs_managed_sse_enabled           = true -> null
      - tags                              = {} -> null
      - tags_all                          = {} -> null
      - url                               = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue" -> null
      - visibility_timeout_seconds        = 300 -> null
    }

  # module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_arn" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/sqs/checklist_evaluation_processor_queue_arn" -> null
      - name      = "/terraform/staging/sqs/checklist_evaluation_processor_queue_arn" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_url" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/sqs/checklist_evaluation_processor_queue_url" -> null
      - name      = "/terraform/staging/sqs/checklist_evaluation_processor_queue_url" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_arn" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/sqs/checklist_generation_processor_queue_arn" -> null
      - name      = "/terraform/staging/sqs/checklist_generation_processor_queue_arn" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_ssm_parameter" "checklist_generation_processor_queue_url" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_url" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/sqs/checklist_generation_processor_queue_url" -> null
      - name      = "/terraform/staging/sqs/checklist_generation_processor_queue_url" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/question_generation_processor_queue_arn" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/sqs/question_generation_processor_queue_arn" -> null
      - name      = "/terraform/staging/sqs/question_generation_processor_queue_arn" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_url will be destroyed
  # (because module.sqs is not in configuration)
  - resource "aws_ssm_parameter" "question_generation_processor_queue_url" {
      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/question_generation_processor_queue_url" -> null
      - data_type = "text" -> null
      - id        = "/terraform/staging/sqs/question_generation_processor_queue_url" -> null
      - name      = "/terraform/staging/sqs/question_generation_processor_queue_url" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
      - tier      = "Standard" -> null
      - type      = "String" -> null
      - value     = (sensitive value) -> null
      - version   = 1 -> null
    }

  # module.sqs[0].aws_sqs_queue.checklist_evaluation_processor_queue will be created
  + resource "aws_sqs_queue" "checklist_evaluation_processor_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "staging-checklist-evaluation-processor-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.sqs[0].aws_sqs_queue.checklist_generation_processor_queue will be created
  + resource "aws_sqs_queue" "checklist_generation_processor_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "staging-checklist-generation-processor-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.sqs[0].aws_sqs_queue.question_generation_processor_queue will be created
  + resource "aws_sqs_queue" "question_generation_processor_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 90
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 2048
      + message_retention_seconds         = 86400
      + name                              = "staging-question-generation-processor-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 10
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.sqs[0].aws_ssm_parameter.checklist_evaluation_processor_queue_arn will be created
  + resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/checklist_evaluation_processor_queue_arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sqs[0].aws_ssm_parameter.checklist_evaluation_processor_queue_url will be created
  + resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/checklist_evaluation_processor_queue_url"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sqs[0].aws_ssm_parameter.checklist_generation_processor_queue_arn will be created
  + resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/checklist_generation_processor_queue_arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sqs[0].aws_ssm_parameter.checklist_generation_processor_queue_url will be created
  + resource "aws_ssm_parameter" "checklist_generation_processor_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/checklist_generation_processor_queue_url"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sqs[0].aws_ssm_parameter.question_generation_processor_queue_arn will be created
  + resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/question_generation_processor_queue_arn"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

  # module.sqs[0].aws_ssm_parameter.question_generation_processor_queue_url will be created
  + resource "aws_ssm_parameter" "question_generation_processor_queue_url" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/terraform/staging/sqs/question_generation_processor_queue_url"
      + tags_all       = (known after apply)
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 28 to add, 0 to change, 25 to destroy.

Error: 2 errors occurred:
	* read_capacity must be at least 1 when billing_mode is "PROVISIONED"
	* write_capacity must be at least 1 when billing_mode is "PROVISIONED"



  with module.dynamodb[0].aws_dynamodb_table.criterion,
  on modules/dynamodb/main.tf line 42, in resource "aws_dynamodb_table" "criterion":
  42: resource "aws_dynamodb_table" "criterion" {

::debug::Terraform exited with code 1.
::debug::stdout: module.rds.aws_ssm_parameter.db_instance_password: Refreshing state... [id=/terraform/staging/rds/db_password]%0Amodule.vpc.data.aws_vpc.default: Reading...%0Amodule.rds.aws_ssm_parameter.db_instance_username: Refreshing state... [id=/terraform/staging/rds/db_username]%0Amodule.sqs.aws_sqs_queue.checklist_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.criterion: Refreshing state... [id=staging-Criterion]%0Amodule.sqs.aws_sqs_queue.question_generation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue]%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Reading...%0Amodule.vpc.data.aws_subnet.public_2[0]: Reading...%0Amodule.dynamodb.aws_dynamodb_table.access_token: Refreshing state... [id=staging-AccessToken]%0Amodule.vpc.data.aws_subnet.public_2[0]: Read complete after 0s [id=subnet-0e6363cd41b9abd3a]%0Amodule.vpc.data.aws_subnet.private_1[0]: Reading...%0Amodule.vpc.data.aws_security_group.rds_postgres_secure[0]: Read complete after 0s [id=sg-00d8df4b18c6781f4]%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Reading...%0Amodule.vpc.data.aws_subnet.public_1[0]: Reading...%0Amodule.sqs.aws_sqs_queue.checklist_evaluation_processor_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue]%0Amodule.vpc.data.aws_security_group.ec2_public[0]: Read complete after 0s [id=sg-0049f561f6149005e]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Reading...%0Amodule.apigateway.aws_api_gateway_rest_api.default: Refreshing state... [id=l6xivppfkg]%0Amodule.dynamodb.aws_dynamodb_table.company: Refreshing state... [id=staging-Company]%0Amodule.vpc.data.aws_subnet.private_1[0]: Read complete after 0s [id=subnet-06383153ba9f3fde3]%0Amodule.vpc.data.aws_subnet.private_2[0]: Reading...%0Amodule.vpc.data.aws_security_group.rds_postgres_insecure[0]: Read complete after 0s [id=sg-0e0df8ed3aa2e4ecf]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_arn]%0Amodule.vpc.data.aws_subnet.public_1[0]: Read complete after 0s [id=subnet-0f27534c3a493385e]%0Amodule.sqs.aws_ssm_parameter.question_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/question_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_url]%0Amodule.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_generation_processor_queue_arn]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_arn]%0Amodule.vpc.data.aws_subnet.private_2[0]: Read complete after 0s [id=subnet-018110fcdfaa13ea2]%0Amodule.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url: Refreshing state... [id=/terraform/staging/sqs/checklist_evaluation_processor_queue_url]%0Amodule.iam.data.aws_iam_role.lambda_role[0]: Read complete after 0s [id=lambda_role]%0Amodule.vpc.data.aws_vpc.default: Read complete after 0s [id=vpc-02b04f5cc72d62471]%0Amodule.rds.aws_db_subnet_group.secure[0]: Refreshing state... [id=staging]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_5xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_5XX]%0Amodule.apigateway.aws_api_gateway_gateway_response.default_4xx: Refreshing state... [id=aggr-l6xivppfkg-DEFAULT_4XX]%0Amodule.apigateway.aws_api_gateway_gateway_response.unauthorized_response: Refreshing state... [id=aggr-l6xivppfkg-UNAUTHORIZED]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_root_resource_id: Refreshing state... [id=/terraform/staging/api_gateway/root_resource_id]%0Amodule.apigateway.aws_ssm_parameter.api_gateway_id: Refreshing state... [id=/terraform/staging/api_gateway/id]%0Amodule.rds.aws_db_instance.secure[0]: Refreshing state... [id=db-QDNBQA3GMWJ5L4VRFGEOQFO6EY]%0Amodule.rds.aws_ssm_parameter.db_instance_name: Refreshing state... [id=/terraform/staging/rds/db_name]%0Amodule.rds.aws_ssm_parameter.db_instance_port: Refreshing state... [id=/terraform/staging/rds/port]%0Amodule.rds.aws_ssm_parameter.db_instance_endpoint: Refreshing state... [id=/terraform/staging/rds/endpoint]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  - destroy%0A%0ATerraform planned the following actions, but then encountered a problem:%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.default_4xx will be destroyed%0A  # (because module.apigateway is not in configuration)%0A  - resource "aws_api_gateway_gateway_response" "default_4xx" {%0A      - id                  = "aggr-l6xivppfkg-DEFAULT_4XX" -> null%0A      - response_parameters = {%0A          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"%0A          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"%0A          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"%0A          - "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"%0A        } -> null%0A      - response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}"%0A        } -> null%0A      - response_type       = "DEFAULT_4XX" -> null%0A      - rest_api_id         = "l6xivppfkg" -> null%0A    }%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.default_5xx will be destroyed%0A  # (because module.apigateway is not in configuration)%0A  - resource "aws_api_gateway_gateway_response" "default_5xx" {%0A      - id                  = "aggr-l6xivppfkg-DEFAULT_5XX" -> null%0A      - response_parameters = {%0A          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"%0A          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"%0A          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"%0A          - "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"%0A        } -> null%0A      - response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}"%0A        } -> null%0A      - response_type       = "DEFAULT_5XX" -> null%0A      - rest_api_id         = "l6xivppfkg" -> null%0A    }%0A%0A  # module.apigateway.aws_api_gateway_gateway_response.unauthorized_response will be destroyed%0A  # (because module.apigateway is not in configuration)%0A  - resource "aws_api_gateway_gateway_response" "unauthorized_response" {%0A      - id                  = "aggr-l6xivppfkg-UNAUTHORIZED" -> null%0A      - response_parameters = {%0A          - "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"%0A          - "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"%0A          - "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"%0A          - "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"%0A        } -> null%0A      - response_templates  = {%0A          - "application/json" = "{\"message\":$context.error.messageString}"%0A        } -> null%0A      - response_type       = "UNAUTHORIZED" -> null%0A      - rest_api_id         = "l6xivppfkg" -> null%0A      - status_code         = "401" -> null%0A    }%0A%0A  # module.apigateway.aws_api_gateway_rest_api.default will be destroyed%0A  # (because module.apigateway is not in configuration)%0A  - resource "aws_api_gateway_rest_api" "default" {%0A      - api_key_source               = "HEADER" -> null%0A      - arn                          = "arn:aws:apigateway:us-east-1::/restapis/l6xivppfkg" -> null%0A      - binary_media_types           = [] -> null%0A      - created_date                 = "2024-01-05T03:45:49Z" -> null%0A      - disable_execute_api_endpoint = false -> null%0A      - execution_arn                = "arn:aws:execute-api:us-east-1:791901361445:l6xivppfkg" -> null%0A      - id                           = "l6xivppfkg" -> null%0A      - name                         = "staging-web-api" -> null%0A      - root_resource_id             = "tgvxm2bra7" -> null%0A      - tags                         = {} -> null%0A      - tags_all                     = {} -> null%0A%0A      - endpoint_configuration {%0A          - types            = [%0A              - "EDGE",%0A            ] -> null%0A          - vpc_endpoint_ids = [] -> null%0A        }%0A    }%0A%0A  # module.apigateway.aws_ssm_parameter.api_gateway_id will be destroyed%0A  # (because module.apigateway is not in configuration)%0A  - resource "aws_ssm_parameter" "api_gateway_id" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/id" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/api_gateway/id" -> null%0A      - name      = "/terraform/staging/api_gateway/id" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.apigateway.aws_ssm_parameter.api_gateway_root_resource_id will be destroyed%0A  # (because module.apigateway is not in configuration)%0A  - resource "aws_ssm_parameter" "api_gateway_root_resource_id" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/api_gateway/root_resource_id" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/api_gateway/root_resource_id" -> null%0A      - name      = "/terraform/staging/api_gateway/root_resource_id" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.apigateway[0].aws_api_gateway_gateway_response.default_4xx will be created%0A  + resource "aws_api_gateway_gateway_response" "default_4xx" {%0A      + id                  = (known after apply)%0A      + response_parameters = {%0A          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"%0A          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"%0A          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"%0A          + "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"%0A        }%0A      + response_templates  = {%0A          + "application/json" = "{\"message\":$context.error.messageString}"%0A        }%0A      + response_type       = "DEFAULT_4XX"%0A      + rest_api_id         = (known after apply)%0A    }%0A%0A  # module.apigateway[0].aws_api_gateway_gateway_response.default_5xx will be created%0A  + resource "aws_api_gateway_gateway_response" "default_5xx" {%0A      + id                  = (known after apply)%0A      + response_parameters = {%0A          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"%0A          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"%0A          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"%0A          + "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"%0A        }%0A      + response_templates  = {%0A          + "application/json" = "{\"message\":$context.error.messageString}"%0A        }%0A      + response_type       = "DEFAULT_5XX"%0A      + rest_api_id         = (known after apply)%0A    }%0A%0A  # module.apigateway[0].aws_api_gateway_gateway_response.unauthorized_response will be created%0A  + resource "aws_api_gateway_gateway_response" "unauthorized_response" {%0A      + id                  = (known after apply)%0A      + response_parameters = {%0A          + "gatewayresponse.header.Access-Control-Allow-Credentials" = "'true'"%0A          + "gatewayresponse.header.Access-Control-Allow-Headers"     = "'*'"%0A          + "gatewayresponse.header.Access-Control-Allow-Methods"     = "'GET,POST,OPTIONS'"%0A          + "gatewayresponse.header.Access-Control-Allow-Origin"      = "'https://www.staging.matchyaa.com'"%0A        }%0A      + response_templates  = {%0A          + "application/json" = "{\"message\":$context.error.messageString}"%0A        }%0A      + response_type       = "UNAUTHORIZED"%0A      + rest_api_id         = (known after apply)%0A      + status_code         = "401"%0A    }%0A%0A  # module.apigateway[0].aws_api_gateway_rest_api.default will be created%0A  + resource "aws_api_gateway_rest_api" "default" {%0A      + api_key_source               = (known after apply)%0A      + arn                          = (known after apply)%0A      + binary_media_types           = (known after apply)%0A      + created_date                 = (known after apply)%0A      + description                  = (known after apply)%0A      + disable_execute_api_endpoint = (known after apply)%0A      + execution_arn                = (known after apply)%0A      + id                           = (known after apply)%0A      + minimum_compression_size     = (known after apply)%0A      + name                         = "staging-web-api"%0A      + policy                       = (known after apply)%0A      + root_resource_id             = (known after apply)%0A      + tags_all                     = (known after apply)%0A    }%0A%0A  # module.apigateway[0].aws_ssm_parameter.api_gateway_id will be created%0A  + resource "aws_ssm_parameter" "api_gateway_id" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/api_gateway/id"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.apigateway[0].aws_ssm_parameter.api_gateway_root_resource_id will be created%0A  + resource "aws_ssm_parameter" "api_gateway_root_resource_id" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/api_gateway/root_resource_id"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.dynamodb.aws_dynamodb_table.access_token will be destroyed%0A  # (because module.dynamodb is not in configuration)%0A  - resource "aws_dynamodb_table" "access_token" {%0A      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-AccessToken" -> null%0A      - billing_mode                = "PROVISIONED" -> null%0A      - deletion_protection_enabled = false -> null%0A      - hash_key                    = "token_id" -> null%0A      - id                          = "staging-AccessToken" -> null%0A      - name                        = "staging-AccessToken" -> null%0A      - read_capacity               = 1 -> null%0A      - stream_enabled              = false -> null%0A      - table_class                 = "STANDARD" -> null%0A      - tags                        = {} -> null%0A      - tags_all                    = {} -> null%0A      - write_capacity              = 1 -> null%0A%0A      - attribute {%0A          - name = "token_id" -> null%0A          - type = "S" -> null%0A        }%0A%0A      - point_in_time_recovery {%0A          - enabled = false -> null%0A        }%0A%0A      - ttl {%0A          - enabled = false -> null%0A        }%0A    }%0A%0A  # module.dynamodb.aws_dynamodb_table.company will be destroyed%0A  # (because module.dynamodb is not in configuration)%0A  - resource "aws_dynamodb_table" "company" {%0A      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-Company" -> null%0A      - billing_mode                = "PROVISIONED" -> null%0A      - deletion_protection_enabled = false -> null%0A      - hash_key                    = "company_id" -> null%0A      - id                          = "staging-Company" -> null%0A      - name                        = "staging-Company" -> null%0A      - read_capacity               = 1 -> null%0A      - stream_enabled              = false -> null%0A      - table_class                 = "STANDARD" -> null%0A      - tags                        = {} -> null%0A      - tags_all                    = {} -> null%0A      - write_capacity              = 1 -> null%0A%0A      - attribute {%0A          - name = "company_id" -> null%0A          - type = "S" -> null%0A        }%0A      - attribute {%0A          - name = "email" -> null%0A          - type = "S" -> null%0A        }%0A%0A      - global_secondary_index {%0A          - hash_key           = "email" -> null%0A          - name               = "EmailIndex" -> null%0A          - non_key_attributes = [] -> null%0A          - projection_type    = "ALL" -> null%0A          - read_capacity      = 10 -> null%0A          - write_capacity     = 10 -> null%0A        }%0A%0A      - point_in_time_recovery {%0A          - enabled = false -> null%0A        }%0A%0A      - ttl {%0A          - enabled = false -> null%0A        }%0A    }%0A%0A  # module.dynamodb.aws_dynamodb_table.criterion will be destroyed%0A  # (because module.dynamodb is not in configuration)%0A  - resource "aws_dynamodb_table" "criterion" {%0A      - arn                         = "arn:aws:dynamodb:us-east-1:791901361445:table/staging-Criterion" -> null%0A      - billing_mode                = "PROVISIONED" -> null%0A      - deletion_protection_enabled = false -> null%0A      - hash_key                    = "id" -> null%0A      - id                          = "staging-Criterion" -> null%0A      - name                        = "staging-Criterion" -> null%0A      - read_capacity               = 1 -> null%0A      - stream_enabled              = false -> null%0A      - table_class                 = "STANDARD" -> null%0A      - tags                        = {} -> null%0A      - tags_all                    = {} -> null%0A      - write_capacity              = 1 -> null%0A%0A      - attribute {%0A          - name = "checklist_id" -> null%0A          - type = "S" -> null%0A        }%0A      - attribute {%0A          - name = "id" -> null%0A          - type = "S" -> null%0A        }%0A%0A      - global_secondary_index {%0A          - hash_key           = "checklist_id" -> null%0A          - name               = "ChecklistIdIndex" -> null%0A          - non_key_attributes = [] -> null%0A          - projection_type    = "ALL" -> null%0A          - read_capacity      = 10 -> null%0A          - write_capacity     = 10 -> null%0A        }%0A%0A      - point_in_time_recovery {%0A          - enabled = false -> null%0A        }%0A%0A      - ttl {%0A          - enabled = false -> null%0A        }%0A    }%0A%0A  # module.dynamodb[0].aws_dynamodb_table.access_token will be created%0A  + resource "aws_dynamodb_table" "access_token" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PROVISIONED"%0A      + hash_key         = "token_id"%0A      + id               = (known after apply)%0A      + name             = "staging-AccessToken"%0A      + read_capacity    = 1%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags_all         = (known after apply)%0A      + write_capacity   = 1%0A%0A      + attribute {%0A          + name = "token_id"%0A          + type = "S"%0A        }%0A    }%0A%0A  # module.dynamodb[0].aws_dynamodb_table.company will be created%0A  + resource "aws_dynamodb_table" "company" {%0A      + arn              = (known after apply)%0A      + billing_mode     = "PROVISIONED"%0A      + hash_key         = "company_id"%0A      + id               = (known after apply)%0A      + name             = "staging-Company"%0A      + read_capacity    = 1%0A      + stream_arn       = (known after apply)%0A      + stream_label     = (known after apply)%0A      + stream_view_type = (known after apply)%0A      + tags_all         = (known after apply)%0A      + write_capacity   = 1%0A%0A      + attribute {%0A          + name = "company_id"%0A          + type = "S"%0A        }%0A      + attribute {%0A          + name = "email"%0A          + type = "S"%0A        }%0A%0A      + global_secondary_index {%0A          + hash_key           = "email"%0A          + name               = "EmailIndex"%0A          + non_key_attributes = []%0A          + projection_type    = "ALL"%0A          + read_capacity      = 10%0A          + write_capacity     = 10%0A        }%0A    }%0A%0A  # module.rds.aws_db_instance.secure[0] will be destroyed%0A  # (because module.rds is not in configuration)%0A  - resource "aws_db_instance" "secure" {%0A      - address                               = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com" -> null%0A      - allocated_storage                     = 20 -> null%0A      - apply_immediately                     = false -> null%0A      - arn                                   = "arn:aws:rds:us-east-1:791901361445:db:staging" -> null%0A      - auto_minor_version_upgrade            = true -> null%0A      - availability_zone                     = "us-east-1a" -> null%0A      - backup_retention_period               = 0 -> null%0A      - backup_target                         = "region" -> null%0A      - backup_window                         = "05:09-05:39" -> null%0A      - ca_cert_identifier                    = "rds-ca-2019" -> null%0A      - copy_tags_to_snapshot                 = false -> null%0A      - customer_owned_ip_enabled             = false -> null%0A      - db_name                               = "staging" -> null%0A      - db_subnet_group_name                  = "staging" -> null%0A      - delete_automated_backups              = true -> null%0A      - deletion_protection                   = false -> null%0A      - enabled_cloudwatch_logs_exports       = [] -> null%0A      - endpoint                              = "staging.chlketxkn9ki.us-east-1.rds.amazonaws.com:5432" -> null%0A      - engine                                = "postgres" -> null%0A      - engine_version                        = "14" -> null%0A      - engine_version_actual                 = "14.9" -> null%0A      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null%0A      - iam_database_authentication_enabled   = false -> null%0A      - id                                    = "db-QDNBQA3GMWJ5L4VRFGEOQFO6EY" -> null%0A      - identifier                            = "staging" -> null%0A      - instance_class                        = "db.t3.micro" -> null%0A      - iops                                  = 0 -> null%0A      - license_model                         = "postgresql-license" -> null%0A      - listener_endpoint                     = [] -> null%0A      - maintenance_window                    = "tue:07:39-tue:08:09" -> null%0A      - master_user_secret                    = [] -> null%0A      - max_allocated_storage                 = 0 -> null%0A      - monitoring_interval                   = 0 -> null%0A      - multi_az                              = false -> null%0A      - network_type                          = "IPV4" -> null%0A      - option_group_name                     = "default:postgres-14" -> null%0A      - parameter_group_name                  = "default.postgres14" -> null%0A      - password                              = (sensitive value) -> null%0A      - performance_insights_enabled          = false -> null%0A      - performance_insights_retention_period = 0 -> null%0A      - port                                  = 5432 -> null%0A      - publicly_accessible                   = false -> null%0A      - replicas                              = [] -> null%0A      - resource_id                           = "db-QDNBQA3GMWJ5L4VRFGEOQFO6EY" -> null%0A      - skip_final_snapshot                   = true -> null%0A      - status                                = "available" -> null%0A      - storage_encrypted                     = false -> null%0A      - storage_throughput                    = 0 -> null%0A      - storage_type                          = "gp2" -> null%0A      - tags                                  = {} -> null%0A      - tags_all                              = {} -> null%0A      - username                              = "postgres" -> null%0A      - vpc_security_group_ids                = [%0A          - "sg-00d8df4b18c6781f4",%0A        ] -> null%0A    }%0A%0A  # module.rds.aws_db_subnet_group.secure[0] will be destroyed%0A  # (because module.rds is not in configuration)%0A  - resource "aws_db_subnet_group" "secure" {%0A      - arn                     = "arn:aws:rds:us-east-1:791901361445:subgrp:staging" -> null%0A      - description             = "Managed by Terraform" -> null%0A      - id                      = "staging" -> null%0A      - name                    = "staging" -> null%0A      - subnet_ids              = [%0A          - "subnet-018110fcdfaa13ea2",%0A          - "subnet-06383153ba9f3fde3",%0A        ] -> null%0A      - supported_network_types = [%0A          - "IPV4",%0A        ] -> null%0A      - tags                    = {} -> null%0A      - tags_all                = {} -> null%0A      - vpc_id                  = "vpc-01c5f678c56d122c2" -> null%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_endpoint will be destroyed%0A  # (because module.rds is not in configuration)%0A  - resource "aws_ssm_parameter" "db_instance_endpoint" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/endpoint" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/rds/endpoint" -> null%0A      - name      = "/terraform/staging/rds/endpoint" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_name will be destroyed%0A  # (because module.rds is not in configuration)%0A  - resource "aws_ssm_parameter" "db_instance_name" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_name" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/rds/db_name" -> null%0A      - name      = "/terraform/staging/rds/db_name" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_password will be destroyed%0A  # (because module.rds is not in configuration)%0A  - resource "aws_ssm_parameter" "db_instance_password" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_password" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/rds/db_password" -> null%0A      - key_id    = "alias/aws/ssm" -> null%0A      - name      = "/terraform/staging/rds/db_password" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "SecureString" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_port will be destroyed%0A  # (because module.rds is not in configuration)%0A  - resource "aws_ssm_parameter" "db_instance_port" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/port" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/rds/port" -> null%0A      - name      = "/terraform/staging/rds/port" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.rds.aws_ssm_parameter.db_instance_username will be destroyed%0A  # (because module.rds is not in configuration)%0A  - resource "aws_ssm_parameter" "db_instance_username" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/rds/db_username" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/rds/db_username" -> null%0A      - name      = "/terraform/staging/rds/db_username" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.rds[0].aws_db_instance.secure[0] will be created%0A  + resource "aws_db_instance" "secure" {%0A      + address                               = (known after apply)%0A      + allocated_storage                     = 20%0A      + apply_immediately                     = false%0A      + arn                                   = (known after apply)%0A      + auto_minor_version_upgrade            = true%0A      + availability_zone                     = (known after apply)%0A      + backup_retention_period               = (known after apply)%0A      + backup_target                         = (known after apply)%0A      + backup_window                         = (known after apply)%0A      + ca_cert_identifier                    = (known after apply)%0A      + character_set_name                    = (known after apply)%0A      + copy_tags_to_snapshot                 = false%0A      + db_name                               = "staging"%0A      + db_subnet_group_name                  = "staging"%0A      + delete_automated_backups              = true%0A      + endpoint                              = (known after apply)%0A      + engine                                = "postgres"%0A      + engine_version                        = "14"%0A      + engine_version_actual                 = (known after apply)%0A      + hosted_zone_id                        = (known after apply)%0A      + id                                    = (known after apply)%0A      + identifier                            = "staging"%0A      + identifier_prefix                     = (known after apply)%0A      + instance_class                        = "db.t3.micro"%0A      + iops                                  = (known after apply)%0A      + kms_key_id                            = (known after apply)%0A      + latest_restorable_time                = (known after apply)%0A      + license_model                         = (known after apply)%0A      + listener_endpoint                     = (known after apply)%0A      + maintenance_window                    = (known after apply)%0A      + master_user_secret                    = (known after apply)%0A      + master_user_secret_kms_key_id         = (known after apply)%0A      + monitoring_interval                   = 0%0A      + monitoring_role_arn                   = (known after apply)%0A      + multi_az                              = (known after apply)%0A      + nchar_character_set_name              = (known after apply)%0A      + network_type                          = (known after apply)%0A      + option_group_name                     = (known after apply)%0A      + parameter_group_name                  = "default.postgres14"%0A      + password                              = (sensitive value)%0A      + performance_insights_enabled          = false%0A      + performance_insights_kms_key_id       = (known after apply)%0A      + performance_insights_retention_period = (known after apply)%0A      + port                                  = (known after apply)%0A      + publicly_accessible                   = false%0A      + replica_mode                          = (known after apply)%0A      + replicas                              = (known after apply)%0A      + resource_id                           = (known after apply)%0A      + skip_final_snapshot                   = true%0A      + snapshot_identifier                   = (known after apply)%0A      + status                                = (known after apply)%0A      + storage_throughput                    = (known after apply)%0A      + storage_type                          = "gp2"%0A      + tags_all                              = (known after apply)%0A      + timezone                              = (known after apply)%0A      + username                              = "postgres"%0A      + vpc_security_group_ids                = [%0A          + "sg-00d8df4b18c6781f4",%0A        ]%0A    }%0A%0A  # module.rds[0].aws_db_subnet_group.secure[0] will be created%0A  + resource "aws_db_subnet_group" "secure" {%0A      + arn                     = (known after apply)%0A      + description             = "Managed by Terraform"%0A      + id                      = (known after apply)%0A      + name                    = "staging"%0A      + name_prefix             = (known after apply)%0A      + subnet_ids              = [%0A          + "subnet-018110fcdfaa13ea2",%0A          + "subnet-06383153ba9f3fde3",%0A        ]%0A      + supported_network_types = (known after apply)%0A      + tags_all                = (known after apply)%0A      + vpc_id                  = (known after apply)%0A    }%0A%0A  # module.rds[0].aws_ssm_parameter.db_instance_endpoint will be created%0A  + resource "aws_ssm_parameter" "db_instance_endpoint" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/rds/endpoint"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.rds[0].aws_ssm_parameter.db_instance_name will be created%0A  + resource "aws_ssm_parameter" "db_instance_name" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/rds/db_name"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.rds[0].aws_ssm_parameter.db_instance_password will be created%0A  + resource "aws_ssm_parameter" "db_instance_password" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/rds/db_password"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "SecureString"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.rds[0].aws_ssm_parameter.db_instance_port will be created%0A  + resource "aws_ssm_parameter" "db_instance_port" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/rds/port"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.rds[0].aws_ssm_parameter.db_instance_username will be created%0A  + resource "aws_ssm_parameter" "db_instance_username" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/rds/db_username"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket.candidate_response will be created%0A  + resource "aws_s3_bucket" "candidate_response" {%0A      + acceleration_status         = (known after apply)%0A      + acl                         = (known after apply)%0A      + arn                         = (known after apply)%0A      + bucket                      = "staging-data-candidate-response"%0A      + bucket_domain_name          = (known after apply)%0A      + bucket_prefix               = (known after apply)%0A      + bucket_regional_domain_name = (known after apply)%0A      + force_destroy               = false%0A      + hosted_zone_id              = (known after apply)%0A      + id                          = (known after apply)%0A      + object_lock_enabled         = (known after apply)%0A      + policy                      = (known after apply)%0A      + region                      = (known after apply)%0A      + request_payer               = (known after apply)%0A      + tags_all                    = (known after apply)%0A      + website_domain              = (known after apply)%0A      + website_endpoint            = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_cors_configuration.candidate_response will be created%0A  + resource "aws_s3_bucket_cors_configuration" "candidate_response" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A%0A      + cors_rule {%0A          + allowed_headers = [%0A              + "*",%0A            ]%0A          + allowed_methods = [%0A              + "GET",%0A              + "POST",%0A              + "PUT",%0A            ]%0A          + allowed_origins = [%0A              + "https://www.staging.matchyaa.com",%0A            ]%0A          + expose_headers  = [%0A              + "ETag",%0A            ]%0A          + max_age_seconds = 3000%0A        }%0A    }%0A%0A  # module.s3.aws_s3_bucket_policy.space_profile will be created%0A  + resource "aws_s3_bucket_policy" "space_profile" {%0A      + bucket = (known after apply)%0A      + id     = (known after apply)%0A      + policy = (known after apply)%0A    }%0A%0A  # module.s3.aws_s3_bucket_public_access_block.candidate_response will be created%0A  + resource "aws_s3_bucket_public_access_block" "candidate_response" {%0A      + block_public_acls       = false%0A      + block_public_policy     = false%0A      + bucket                  = (known after apply)%0A      + id                      = (known after apply)%0A      + ignore_public_acls      = false%0A      + restrict_public_buckets = false%0A    }%0A%0A  # module.sqs.aws_sqs_queue.checklist_evaluation_processor_queue will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_sqs_queue" "checklist_evaluation_processor_queue" {%0A      - arn                               = "arn:aws:sqs:us-east-1:791901361445:staging-checklist-evaluation-processor-queue" -> null%0A      - content_based_deduplication       = false -> null%0A      - delay_seconds                     = 90 -> null%0A      - fifo_queue                        = false -> null%0A      - id                                = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue" -> null%0A      - kms_data_key_reuse_period_seconds = 300 -> null%0A      - max_message_size                  = 2048 -> null%0A      - message_retention_seconds         = 86400 -> null%0A      - name                              = "staging-checklist-evaluation-processor-queue" -> null%0A      - receive_wait_time_seconds         = 10 -> null%0A      - sqs_managed_sse_enabled           = true -> null%0A      - tags                              = {} -> null%0A      - tags_all                          = {} -> null%0A      - url                               = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-evaluation-processor-queue" -> null%0A      - visibility_timeout_seconds        = 300 -> null%0A    }%0A%0A  # module.sqs.aws_sqs_queue.checklist_generation_processor_queue will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_sqs_queue" "checklist_generation_processor_queue" {%0A      - arn                               = "arn:aws:sqs:us-east-1:791901361445:staging-checklist-generation-processor-queue" -> null%0A      - content_based_deduplication       = false -> null%0A      - delay_seconds                     = 90 -> null%0A      - fifo_queue                        = false -> null%0A      - id                                = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue" -> null%0A      - kms_data_key_reuse_period_seconds = 300 -> null%0A      - max_message_size                  = 2048 -> null%0A      - message_retention_seconds         = 86400 -> null%0A      - name                              = "staging-checklist-generation-processor-queue" -> null%0A      - receive_wait_time_seconds         = 10 -> null%0A      - sqs_managed_sse_enabled           = true -> null%0A      - tags                              = {} -> null%0A      - tags_all                          = {} -> null%0A      - url                               = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-checklist-generation-processor-queue" -> null%0A      - visibility_timeout_seconds        = 300 -> null%0A    }%0A%0A  # module.sqs.aws_sqs_queue.question_generation_processor_queue will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_sqs_queue" "question_generation_processor_queue" {%0A      - arn                               = "arn:aws:sqs:us-east-1:791901361445:staging-question-generation-processor-queue" -> null%0A      - content_based_deduplication       = false -> null%0A      - delay_seconds                     = 90 -> null%0A      - fifo_queue                        = false -> null%0A      - id                                = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue" -> null%0A      - kms_data_key_reuse_period_seconds = 300 -> null%0A      - max_message_size                  = 2048 -> null%0A      - message_retention_seconds         = 86400 -> null%0A      - name                              = "staging-question-generation-processor-queue" -> null%0A      - receive_wait_time_seconds         = 10 -> null%0A      - sqs_managed_sse_enabled           = true -> null%0A      - tags                              = {} -> null%0A      - tags_all                          = {} -> null%0A      - url                               = "https://sqs.us-east-1.amazonaws.com/791901361445/staging-question-generation-processor-queue" -> null%0A      - visibility_timeout_seconds        = 300 -> null%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_arn will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_arn" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/sqs/checklist_evaluation_processor_queue_arn" -> null%0A      - name      = "/terraform/staging/sqs/checklist_evaluation_processor_queue_arn" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.checklist_evaluation_processor_queue_url will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_evaluation_processor_queue_url" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/sqs/checklist_evaluation_processor_queue_url" -> null%0A      - name      = "/terraform/staging/sqs/checklist_evaluation_processor_queue_url" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_arn will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_arn" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/sqs/checklist_generation_processor_queue_arn" -> null%0A      - name      = "/terraform/staging/sqs/checklist_generation_processor_queue_arn" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.checklist_generation_processor_queue_url will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_ssm_parameter" "checklist_generation_processor_queue_url" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/checklist_generation_processor_queue_url" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/sqs/checklist_generation_processor_queue_url" -> null%0A      - name      = "/terraform/staging/sqs/checklist_generation_processor_queue_url" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_arn will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/question_generation_processor_queue_arn" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/sqs/question_generation_processor_queue_arn" -> null%0A      - name      = "/terraform/staging/sqs/question_generation_processor_queue_arn" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.sqs.aws_ssm_parameter.question_generation_processor_queue_url will be destroyed%0A  # (because module.sqs is not in configuration)%0A  - resource "aws_ssm_parameter" "question_generation_processor_queue_url" {%0A      - arn       = "arn:aws:ssm:us-east-1:791901361445:parameter/terraform/staging/sqs/question_generation_processor_queue_url" -> null%0A      - data_type = "text" -> null%0A      - id        = "/terraform/staging/sqs/question_generation_processor_queue_url" -> null%0A      - name      = "/terraform/staging/sqs/question_generation_processor_queue_url" -> null%0A      - tags      = {} -> null%0A      - tags_all  = {} -> null%0A      - tier      = "Standard" -> null%0A      - type      = "String" -> null%0A      - value     = (sensitive value) -> null%0A      - version   = 1 -> null%0A    }%0A%0A  # module.sqs[0].aws_sqs_queue.checklist_evaluation_processor_queue will be created%0A  + resource "aws_sqs_queue" "checklist_evaluation_processor_queue" {%0A      + arn                               = (known after apply)%0A      + content_based_deduplication       = false%0A      + deduplication_scope               = (known after apply)%0A      + delay_seconds                     = 90%0A      + fifo_queue                        = false%0A      + fifo_throughput_limit             = (known after apply)%0A      + id                                = (known after apply)%0A      + kms_data_key_reuse_period_seconds = (known after apply)%0A      + max_message_size                  = 2048%0A      + message_retention_seconds         = 86400%0A      + name                              = "staging-checklist-evaluation-processor-queue"%0A      + name_prefix                       = (known after apply)%0A      + policy                            = (known after apply)%0A      + receive_wait_time_seconds         = 10%0A      + redrive_allow_policy              = (known after apply)%0A      + redrive_policy                    = (known after apply)%0A      + sqs_managed_sse_enabled           = (known after apply)%0A      + tags_all                          = (known after apply)%0A      + url                               = (known after apply)%0A      + visibility_timeout_seconds        = 300%0A    }%0A%0A  # module.sqs[0].aws_sqs_queue.checklist_generation_processor_queue will be created%0A  + resource "aws_sqs_queue" "checklist_generation_processor_queue" {%0A      + arn                               = (known after apply)%0A      + content_based_deduplication       = false%0A      + deduplication_scope               = (known after apply)%0A      + delay_seconds                     = 90%0A      + fifo_queue                        = false%0A      + fifo_throughput_limit             = (known after apply)%0A      + id                                = (known after apply)%0A      + kms_data_key_reuse_period_seconds = (known after apply)%0A      + max_message_size                  = 2048%0A      + message_retention_seconds         = 86400%0A      + name                              = "staging-checklist-generation-processor-queue"%0A      + name_prefix                       = (known after apply)%0A      + policy                            = (known after apply)%0A      + receive_wait_time_seconds         = 10%0A      + redrive_allow_policy              = (known after apply)%0A      + redrive_policy                    = (known after apply)%0A      + sqs_managed_sse_enabled           = (known after apply)%0A      + tags_all                          = (known after apply)%0A      + url                               = (known after apply)%0A      + visibility_timeout_seconds        = 300%0A    }%0A%0A  # module.sqs[0].aws_sqs_queue.question_generation_processor_queue will be created%0A  + resource "aws_sqs_queue" "question_generation_processor_queue" {%0A      + arn                               = (known after apply)%0A      + content_based_deduplication       = false%0A      + deduplication_scope               = (known after apply)%0A      + delay_seconds                     = 90%0A      + fifo_queue                        = false%0A      + fifo_throughput_limit             = (known after apply)%0A      + id                                = (known after apply)%0A      + kms_data_key_reuse_period_seconds = (known after apply)%0A      + max_message_size                  = 2048%0A      + message_retention_seconds         = 86400%0A      + name                              = "staging-question-generation-processor-queue"%0A      + name_prefix                       = (known after apply)%0A      + policy                            = (known after apply)%0A      + receive_wait_time_seconds         = 10%0A      + redrive_allow_policy              = (known after apply)%0A      + redrive_policy                    = (known after apply)%0A      + sqs_managed_sse_enabled           = (known after apply)%0A      + tags_all                          = (known after apply)%0A      + url                               = (known after apply)%0A      + visibility_timeout_seconds        = 300%0A    }%0A%0A  # module.sqs[0].aws_ssm_parameter.checklist_evaluation_processor_queue_arn will be created%0A  + resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_arn" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/checklist_evaluation_processor_queue_arn"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.sqs[0].aws_ssm_parameter.checklist_evaluation_processor_queue_url will be created%0A  + resource "aws_ssm_parameter" "checklist_evaluation_processor_queue_url" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/checklist_evaluation_processor_queue_url"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.sqs[0].aws_ssm_parameter.checklist_generation_processor_queue_arn will be created%0A  + resource "aws_ssm_parameter" "checklist_generation_processor_queue_arn" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/checklist_generation_processor_queue_arn"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.sqs[0].aws_ssm_parameter.checklist_generation_processor_queue_url will be created%0A  + resource "aws_ssm_parameter" "checklist_generation_processor_queue_url" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/checklist_generation_processor_queue_url"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.sqs[0].aws_ssm_parameter.question_generation_processor_queue_arn will be created%0A  + resource "aws_ssm_parameter" "question_generation_processor_queue_arn" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/question_generation_processor_queue_arn"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0A  # module.sqs[0].aws_ssm_parameter.question_generation_processor_queue_url will be created%0A  + resource "aws_ssm_parameter" "question_generation_processor_queue_url" {%0A      + arn            = (known after apply)%0A      + data_type      = (known after apply)%0A      + id             = (known after apply)%0A      + insecure_value = (known after apply)%0A      + key_id         = (known after apply)%0A      + name           = "/terraform/staging/sqs/question_generation_processor_queue_url"%0A      + tags_all       = (known after apply)%0A      + tier           = (known after apply)%0A      + type           = "String"%0A      + value          = (sensitive value)%0A      + version        = (known after apply)%0A    }%0A%0APlan: 28 to add, 0 to change, 25 to destroy.%0A
::debug::stderr: %0AError: 2 errors occurred:%0A	* read_capacity must be at least 1 when billing_mode is "PROVISIONED"%0A	* write_capacity must be at least 1 when billing_mode is "PROVISIONED"%0A%0A%0A%0A  with module.dynamodb[0].aws_dynamodb_table.criterion,%0A  on modules/dynamodb/main.tf line 42, in resource "aws_dynamodb_table" "criterion":%0A  42: resource "aws_dynamodb_table" "criterion" {%0A%0A
::debug::exitcode: 1
::error::Terraform exited with code 1.

```